<?php

return [
//======================================================================================================================
//-- Блоки использующиеся на всем сайте --
//======================================================================================================================
    'static_all_site'   => [
        'images'       => ['logo'],
        'stringfields' => ['phone', 'mob_phone', 'map_link', 'copy', 'slog']
    ],
//======================================================================================================================
//-- Главная страница --
//======================================================================================================================
    'static_index_page' => [
        'images'       => ['background'],
        'stringfields' => ['seo_title', 'seo_description', 'seo_keywords', 'seo_text', 'page_name'],
        'textfields'   => ['page_content']

    ],
    'static_facts'      => [
        'groups' => [
            'fact' => [
                'images'       => ['fact_pict'],
                'stringfields' => ['fact_title']
            ]
        ]
    ],
//======================================================================================================================
//-- Страницы обучения --
//======================================================================================================================
    'dom_study'         => [
        'images'       => ['background', 'index_preview'],
        'stringfields' => ['seo_title', 'seo_description', 'seo_keywords', 'seo_text', 'page_name', 'preview_text'],
        'textfields'   => ['page_content'],
        'groups'       => [
            'course'       => [
                'stringfields' => ['seo_title', 'seo_description', 'seo_keywords', 'seo_text', 'page_name', 'preview_text'],
                'textfields'   => ['page_content'],
                'images'       => ['background', 'preview'],
                'numb'         => ['cost']
            ],
            'course_image' => [
                'owner'  => 'course',
                'images' => ['course_pict']
            ]
        ]
    ],
//======================================================================================================================
//-- Страницы услуг --
//======================================================================================================================
    'dom_service'       => [
        'groups' => [
            'service'       => [
                'stringfields' => ['service_name', 'name'],
                'textfields'   => ['about_service']
            ],
            'service_image' => [
                'owner'  => 'service',
                'images' => ['serv_pict']
            ]
        ]
    ],
//======================================================================================================================
//-- Новости --
//======================================================================================================================
    'dom_news'          => [
        'title'  => 'news',
        'images' => ['head'],
        'groups' => [
            'news' => [
                'stringfields' => ['link', 'news_title', 'news_date', 'agregator'],
                'textfields'   => ['about_news'],
            ]
        ]
    ],
//======================================================================================================================
//-- Служебные блоки --
//======================================================================================================================
    'dom_all_images'    => [
        'groups' => [
            'images_set' => [
                'images' => ['text_pict']
            ]
        ]
    ],


    'static_contacts' => [
        'title'      => '',
        'textfields' => ['map'],
        'images'     => ['head']
    ],
    'test_block'      => [
        'title'      => '',
        'textfields' => ['map'],
        'images'     => ['head']
    ],

//======================================================================================================================
//-- Формы обратной связи --
//======================================================================================================================
    'fidback'         => [
        'stringfields' => ['mail_rec', 'mail_username', 'site_name'],
        'groups'       => [
            'join'        => [
                'stringfields' => ['fio', 'email', 'phone', 'program'],
                'bools'        => ['mailed']
            ],
            'ask'         => [
                'stringfields' => ['fio', 'email', 'question'],
                'bools'        => ['mailed']
            ],
            'buy_service' => [
                'stringfields' => ['fio', 'email', 'phone', 'service'],
                'bools'        => ['mailed']
            ]
        ]
    ]


];
